const journalPosts = [
    {
        "date": "2026-08-01",
        "title": "Відкладання на потім працює бездоганно",
        "file": "journal/2026-08-01-Відкладання на потім працює бездоганно/Відкладання на потім працює бездоганно.md"
    },
    {
        "date": "2026-07-31",
        "title": "Себе видно тільки в дії",
        "file": "journal/2026-07-31-Себе видно тільки в дії/Себе видно тільки в дії.md"
    },
    {
        "date": "2026-07-30",
        "title": "Чому найстрашніші сни насправді найкорисніші",
        "file": "journal/2026-07-30-Чому найстрашніші сни насправді найкорисніші/Чому найстрашніші сни насправді найкорисніші.md"
    },
    {
        "date": "2026-07-29",
        "title": "Емпатія починається з себе",
        "file": "journal/2026-07-29-Емпатія починається з себе/Емпатія починається з себе.md"
    },
    {
        "date": "2026-07-28",
        "title": "Втома чи втрата сенсу",
        "file": "journal/2026-07-28-Втома чи втрата сенсу/Втома чи втрата сенсу.md"
    }
];